Repository: dmitrykorolev-work/PixHide
Catalog: PixHide.WinUI3App/Strings/*/Resources.resw
Source language: en_us
Languages: uk_ua

# EncodeTab.Content
source: Encode
uk_ua: Кодування

# DecodeTab.Content
source: Decode
uk_ua: Декодування

# EncoderSelectImageButton.Content
source: Select Image
uk_ua: Обрати зображення

# SelectDataFileButton.Content
source: Select Data File
uk_ua: Обрати файл даних

# EncoderSettingsTitle.Text
source: LSB Encoding Settings
uk_ua: Налаштування LSB-кодування

# BitsPerChannelSlider.Header
source: Bits Per Channel
uk_ua: Бітів на канал

# EncoderDataCapacityTitle.Text
source: Data Capacity
uk_ua: Місткість даних

# EncoderUsedRun.Text
source: Used:
uk_ua: Використано:

# DitheringCheckBox.Content
source: Dithering
uk_ua: Дизеринг

# ContrastAdjustmentCheckBox.Content
source: Contrast Adjustment
uk_ua: Корекція контрасту

# EncodeButton.Content
source: Encode
uk_ua: Кодувати

# DecoderSelectImageButton.Content
source: Select Image
uk_ua: Обрати зображення

# DecoderDataCapacityTitle.Text
source: Data Capacity
uk_ua: Місткість даних

# DecoderUsedRun.Text
source: Used:
uk_ua: Використано:

# DecodeButton.Content
source: Decode
uk_ua: Декодувати

# PreviewSaveMenuItem.Text
source: Save
uk_ua: Зберегти

# PreviewSaveAsMenuItem.Text
source: Save As
uk_ua: Зберегти як

# PreviewEmptyStateText.Text
source: Select an image or drag & drop here
uk_ua: Оберіть зображення або перетягніть його сюди

# PreviewChooseImageButton.Content
source: Choose Image
uk_ua: Обрати зображення

# ImageItemOpenMenuItem.Text
source: Open
uk_ua: Відкрити

# ImageItemSaveAsMenuItem.Text
source: Save As
uk_ua: Зберегти як

# ImageItemDeleteMenuItem.Text
source: Delete
uk_ua: Видалити

# ImageItemDeleteConfirmTitle
source: Delete Image
uk_ua: Видалення зображення

# ImageItemDeleteConfirmContent
source: Are you sure you want to delete this image?
uk_ua: Ви впевнені, що хочете видалити це зображення?

source: Yes
uk_ua: Так

source: No
uk_ua: Ні

source: Encoding Failed
uk_ua: Кодування не вдалося

# EncodingFailedMessage
source: An error occurred during encoding:
uk_ua: Під час кодування сталася помилка:

source: Decoding Failed
uk_ua: Декодування не вдалося

# DecodingFailedMessage
source: An error occurred during decoding:
uk_ua: Під час декодування сталася помилка:

# NoHiddenDataFound
source: No hidden data found in the image or data is corrupted.
uk_ua: У зображенні не знайдено прихованих даних або дані пошкоджені.

# OpenSettingsButtonText.Text
source: Settings
uk_ua: Налаштування

# LanguageChangeTitle
source: Language Changed
uk_ua: Мова змінена

# LanguageChangeMessage
source: Language has been changed. Please restart the application to apply the new language.
uk_ua: Мову змінено. Будь ласка, перезапустіть додаток, щоб застосувати зміни.

# LanguageSettingsCard.Header
source: Language
uk_ua: Мова

# LanguageSettingsCard.Description
source: Select your preferred language.
uk_ua: Виберіть бажану мову.

# BackdropSettingsCard.Header
source: Window backdrop
uk_ua: Фон вікна

# BackdropSettingsCard.Description
source: Select your preferred window backdrop.
uk_ua: Виберіть бажаний фон вікна.

# ThemeSettingsCard.Header
source: Window theme
uk_ua: Тема вікна

# ThemeSettingsCard.Description
source: Select your preferred window theme.
uk_ua: Виберіть бажану тему вікна.

# AddImageFailed
source: Failed to add image
uk_ua: Не вдалося додати зображення

# AddImageFailedMessage
source: An error occurred while adding the image:
uk_ua: Під час додавання зображення сталася помилка:

# DeleteImageFailed
source: Failed to delete image
uk_ua: Не вдалося видалити зображення

# DeleteImageFailedMessage
source: An error occurred while deleting the image:
uk_ua: Під час видалення зображення сталася помилка:
